-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Окт 28 2026 г., 14:52
-- Версия сервера: 8.0.12
-- Версия PHP: 7.2.10

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `avtodor_doc_db`
--

-- --------------------------------------------------------

--
-- Структура таблицы `dis_build`
--

CREATE TABLE `dis_build` (
  `id` int(11) NOT NULL,
  `cod_isso` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `upravlenie` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `constr_name` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `isso_type` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `road_name` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `location` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `location_type` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `dop_id` varchar(500) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `type_obstacle` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `hindrance_name` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `region` varchar(300) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `exploit_org` varchar(250) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `year_start_exploit` varchar(100) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `expert_rating` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `const_length` varchar(200) CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `id_dog` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `executor` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `note` text CHARACTER SET utf8 COLLATE utf8_general_ci NOT NULL,
  `dop_info` text CHARACTER SET utf8 COLLATE utf8_general_ci
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='construction_list';

--
-- Дамп данных таблицы `dis_build`
--

INSERT INTO `dis_build` (`id`, `cod_isso`, `upravlenie`, `constr_name`, `isso_type`, `road_name`, `location`, `location_type`, `dop_id`, `type_obstacle`, `hindrance_name`, `region`, `exploit_org`, `year_start_exploit`, `expert_rating`, `const_length`, `id_dog`, `executor`, `note`, `dop_info`) VALUES
(1, '2302917', 'Голицынский филиал ГК \"Автодор\"', 'Пешеходный переход в разных уровнях', 'Пешеходный мост', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '22+100', 'основная дорога', '', 'автомобильная дорога', 'а/д А105 Подъездная дорога от Москвы к аэропорту Домодедово', 'Московская область', '[нет сведений]', '2002', 'хорошее', '154,98', 'Внутренний | 111-тест | 2021-04-01||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ДЭиБДД-2022-2325 | 2022-12-20||ГК \"Автодор\" | ТЕСТ-111-2026 | 2026-05-07||ГК \"Автодор\" | ТЕСТ-111-2026 | 2026-05-07||ГК \"Автодор\" | ТЕСТ-111-2026 | 2026-05-07||ГК \"Автодор\" | ТЕСТ-111-2026 | 2026-05-07', 'ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ОДИС||ООО \"Автодор-Инжиниринг\"||ООО \"Автодор-Инжиниринг\"||ООО \"Автодор-Инжиниринг\"||ООО \"Автодор-Инжиниринг\"', '2325', ''),
(2, '2301210', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '22+220', 'основная дорога', '', 'периодический водоток', 'суходол', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'хорошее', '26,42', '||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19', '||||||||||||ОДИС', 'extExex_TZ2', ''),
(3, '2303201', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '23+425', 'основная дорога', '', 'периодический водоток', 'суходол', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'хорошее', '24,27', '||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19', '||||||', 'extExex_TZ2', ''),
(4, '2301211', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '23+425', 'основная дорога', '', 'периодический водоток', 'суходол', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'удовлетворительное', '23,2', '||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19', '||||||||||||ОДИС||||||||||||||ОДИС||ОДИС', 'extExex_TZ2', ''),
(5, '2301212', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '24+200', 'основная дорога', '', 'периодический водоток', 'суходол', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'хорошее', '19,61', '||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19', '||||||||||', 'extExex_TZ2', ''),
(6, '2301213', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '24+535', 'основная дорога', '', 'периодический водоток', 'суходол', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'хорошее', '80,4', '||Внутренний | 111-тест_1 | 2022-10-19||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19||||Внутренний | 111-тест_1 | 2022-10-19', '||||||||||', 'extExex_TZ2', ''),
(7, '2301214', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '26+153', 'основная дорога', '', 'постоянный водоток', 'ручей', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'хорошее', '84,1', '||Внутренний | 111-тест_1 | 2022-10-19', '||', 'extExex_TZ2', ''),
(8, '2301215', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '26+742', 'основная дорога', '', 'постоянный водоток', 'ручей', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'удовлетворительное', '35,54', '', '', 'extExex_TZ2', ''),
(9, '2301216', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '26+958', 'основная дорога', '', 'периодический водоток', 'суходол', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'хорошее', '123,72', '', '', 'ExtExec', ''),
(10, '2301217', 'Голицынский филиал ГК \"Автодор\"', 'Труба', 'Железобетонная труба', 'А-105 Подъездная дорога от Москвы к аэропорту Домодедово', '29+870', 'основная дорога', '', 'постоянный водоток', 'ручей', 'Московская область', 'ООО \"Строительная фирма МарМи\"', '1963', 'удовлетворительное', '135,4', '', '', 'extExex_TZ2', '');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `dis_build`
--
ALTER TABLE `dis_build`
  ADD PRIMARY KEY (`id`),
  ADD KEY `cod_isso` (`cod_isso`),
  ADD KEY `upravlenie` (`upravlenie`),
  ADD KEY `constr_name` (`constr_name`),
  ADD KEY `road_name` (`road_name`),
  ADD KEY `location` (`location`),
  ADD KEY `hindrance_name` (`hindrance_name`),
  ADD KEY `region` (`region`),
  ADD KEY `isso_type` (`isso_type`),
  ADD KEY `location_type` (`location_type`),
  ADD KEY `exploit_org` (`exploit_org`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `dis_build`
--
ALTER TABLE `dis_build`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=9108;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
